In [3]:
# 1st.
original_list = [-1,2,-3,4,-5,6,-7,8,-9,10,-11,12]

# list_less = lambda x : x if(x < 0) else None
# print(list_less(original_list))

# list_less = lambda x : original_list if x > 0 else "nope"
# print(list_less(2))

even_list = list(filter(lambda x : (x > 0), original_list))
odd_list = list(filter(lambda x : (x < 0), original_list))
odd_list.reverse()
final_list = even_list + odd_list
print(final_list)

[2, 4, 6, 8, 10, 12, -11, -9, -7, -5, -3, -1]

In [4]:
import pandas as pd
import numpy as np
data_df = pd.read_csv('JEOPARDY_DATA.csv')
data_df.head()

,Show Number,Air Date,Round,Category,Value,Question,Answer
0,4680,12/31/2004,Jeopardy!,HISTORY,$200,"For the last 8 years of his life, Galileo was ...",Copernicus
1,4680,12/31/2004,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,$200,No. 2: 1912 Olympian; football star at Carlisl...,Jim Thorpe
2,4680,12/31/2004,Jeopardy!,EVERYBODY TALKS ABOUT IT...,$200,The city of Yuma in this state has a record av...,Arizona
3,4680,12/31/2004,Jeopardy!,THE COMPANY LINE,$200,"In 1963, live on ""The Art Linkletter Show"", th...",McDonald's
4,4680,12/31/2004,Jeopardy!,EPITAPHS & TRIBUTES,$200,"Signer of the Dec. of Indep., framer of the Co...",John Adams

In [5]:
data_df.columns
one_hot_encoding_round = pd.get_dummies(data_df, columns = [' Round'])
one_hot_encoding_round.head()

,Show Number,Air Date,Category,Value,Question,Answer,Round_Double Jeopardy!,Round_Final Jeopardy!,Round_Jeopardy!,Round_Tiebreaker
0,4680,12/31/2004,HISTORY,$200,"For the last 8 years of his life, Galileo was ...",Copernicus,False,False,True,False
1,4680,12/31/2004,ESPN's TOP 10 ALL-TIME ATHLETES,$200,No. 2: 1912 Olympian; football star at Carlisl...,Jim Thorpe,False,False,True,False
2,4680,12/31/2004,EVERYBODY TALKS ABOUT IT...,$200,The city of Yuma in this state has a record av...,Arizona,False,False,True,False
3,4680,12/31/2004,THE COMPANY LINE,$200,"In 1963, live on ""The Art Linkletter Show"", th...",McDonald's,False,False,True,False
4,4680,12/31/2004,EPITAPHS & TRIBUTES,$200,"Signer of the Dec. of Indep., framer of the Co...",John Adams,False,False,True,False

In [151]:
data_df.columns
data_df[' Value']

0           $200
1           $200
2           $200
3           $200
4           $200
           ...
216925    $2,000
216926    $2,000
216927    $2,000
216928    $2,000
216929        NaN
Name:  Value, Length: 216930, dtype: object

In [191]:
data_df[' Value'] = data_df[' Value'].str.replace('$','')

# filtered_list = [string.replace(' ','') for string in data_df[' Value']]

In [204]:
data_df[' Value'] = data_df[' Value'].str.replace(',','')
data_df[' Value'] = data_df[' Value'].str.replace(' ','')
data_df[' Value'].astype(float)
# data_df.head()

0          200.0
1          200.0
2          200.0
3          200.0
4          200.0
           ...
216925    2000.0
216926    2000.0
216927    2000.0
216928    2000.0
216929       NaN
Name:  Value, Length: 216930, dtype: float64

# Bonus

It would be difficult to make a first-class money type because placing commas in the amount could make it difficult and confusing. For example, we had to remove our comma in the thousands. You wuld have to put a comma every three digits and that could be a problem. For example, you could put $300, and the function would make it $ ,300.00"

hi